## pandas入门

In [15]:
#我们将使用这样得约定引入pandas
import pandas as pd
import numpy as np

### pandas的数据结构介绍
#### Series

Series是一种类似于一维数组的对象，它由一组数据（各种NumPy数据类型）以
及一组与之相关的数据标签（即索引）组成。

In [4]:
#Series的字符串表现形式为：索引在左边，值在右边。
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
#你可以通过Series 的values和index属性获取其数组表示形式和索引对象
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
#通常，我们希望所创建的Series带有一个可以对各个数据点进行标记的索引
obj2 = pd.Series([4,7,-5,3], index=('a','b','c','d'))
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [8]:
#与普通NumPy数组相比，你可以通过索引的方式选取Series中的单个或一组值
obj2['a']

4

In [11]:
obj2[['a','b','c']] #多个的话注意方括号内传入的是个一个列表

a    4
b    7
c   -5
dtype: int64

In [12]:
#根据布尔形数组进行过滤
obj2[obj2 > 0]

a    4
b    7
d    3
dtype: int64

In [13]:
#标量乘法
obj2 * 2

a     8
b    14
c   -10
d     6
dtype: int64

In [16]:
#应用数学函数
np.exp(obj2)

a      54.598150
b    1096.633158
c       0.006738
d      20.085537
dtype: float64

In [17]:
#如果数据被存放在一个Python字典中，也可以直接通过这个字典来创建Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
#如果只传入一个字典，则结果Series中的索引就是原字典的键（有序排列）。
#你可以传入排好序的字典的键以改变顺序
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
#我将使用缺失（missing）或NA表示缺失数据。
#pandas的isnull和notnull函数可用于检测缺失数据
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
#Series也有类似的实例方法
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

建DataFrame的办法有很多，最常用的一种是直接传入一个由等长列表或NumPy
数组组成的字典

In [22]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame #结果DataFrame会自动加上索引（跟Series一样），且全部列会被有序排列

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
#对于特别大的DataFrame，head方法会选取前五行
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [24]:
#如果指定了列序列，则DataFrame的列就会按照指定顺序进行排列:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [25]:
#如果传入的列在数据中找不到，就会在结果中产生缺失值
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [26]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [29]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [30]:
#注意，返回的Series拥有原DataFrame相同的索引，且其name属性也已经被相应地设置好了
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [31]:
#行也可以通过位置或名称的方式进行获取，比如用loc属性
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [32]:
#列可以通过赋值的方式进行修改
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [34]:
#将列表或数组赋值给某个列时，其长度必须跟DataFrame的长度相匹配
#如果赋值的是一个Series，就会精确匹配DataFrame的索引
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [36]:
#为不存在的列赋值会创建出一个新列
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [37]:
#del方法可以用来删除这列
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')